/*********************************************Copyright (c)***********************************************
**                                Guangzhou ZLG MCU Technology Co., Ltd.
**
**                                        http://www.zlgmcu.com
**
**      广州周立功单片机科技有限公司所提供的所有服务内容旨在协助客户加速产品的研发进度，在服务过程中所提供
**  的任何程序、文档、测试结果、方案、支持等资料和信息，都仅供参考，客户有权不使用或自行参考修改，本公司不
**  提供任何的完整性、可靠性等保证，若在客户使用过程中因任何原因造成的特别的、偶然的或间接的损失，本公司不
**  承担任何责任。
**                                                                        ――广州周立功单片机科技有限公司
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:               imu_i2c.h
** Last modified Date:      2018-10-19
** Last Version:            1.0
** Description:             imu's i2c driver files 
**
**--------------------------------------------------------------------------------------------------------
** Created By:              liguangdao
** Created date:            2018-04-10
** Version:                 1.0
** Descriptions:            The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             lgd(liguangdao)
** Modified date:           2018-10-19
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/

#ifndef __IMU_I2C_H 
#define __IMU_I2C_H 

#ifdef __cplusplus
extern "C" {
#endif
    
/*********************************************************************************************************
 MACRO 
*********************************************************************************************************/


/*********************************************************************************************************
 Variables declare
*********************************************************************************************************/  
 

/*********************************************************************************************************
 function declare
*********************************************************************************************************/
void   imuI2cInit (void);
void   ms5611RegInit (void);
void   ms5611Read (SENSOR_DATA *ptMPU);
    
void    ms5611Reset (void);
INT16U  ms5611PromRead (INT8U ucAddr);
void    ms561ConvStart (INT8U ucConvCmd);
INT32U  ms5611ConvRead (void);


   
        
#ifdef __cplusplus
}
#endif


#endif


/*********************************************************************************************************
 End Of File 
*********************************************************************************************************/
