/*********************************************Copyright (c)***********************************************
**                                Guangzhou ZLG MCU Technology Co., Ltd.
**
**                                        http://www.zlgmcu.com
**
**      广州周立功单片机科技有限公司所提供的所有服务内容旨在协助客户加速产品的研发进度，在服务过程中所提供
**  的任何程序、文档、测试结果、方案、支持等资料和信息，都仅供参考，客户有权不使用或自行参考修改，本公司不
**  提供任何的完整性、可靠性等保证，若在客户使用过程中因任何原因造成的特别的、偶然的或间接的损失，本公司不
**  承担任何责任。
**                                                                        ――广州周立功单片机科技有限公司
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:               imu_spi.c
** Last modified Date:      2018-10-19
** Last Version:            1.0
** Description:             imu's spi driver files 
**
**--------------------------------------------------------------------------------------------------------
** Created By:              liguangdao
** Created date:            2018-04-10
** Version:                 1.0
** Descriptions:            The original version 初始版本
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             lgd(liguangdao)
** Modified date:           2018-10-19
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/

#ifndef __IMU_SPI_H 
#define __IMU_SPI_H 

#ifdef __cplusplus
extern "C" {
#endif
    
/*********************************************************************************************************
 MACRO 
*********************************************************************************************************/


/*********************************************************************************************************
 Variables declare
*********************************************************************************************************/  
   


/*********************************************************************************************************
 function declare
*********************************************************************************************************/
void imuSpiInit(void);
void mpu6500RegInit(void); 
//void mpu6500Read(SENSOR_DATA *ptMPU);  for some reason. 

INT8U spiReadWriteByte(INT32U ulPcs, INT8U ucReg, INT8U ucData);
void  spiReadWriteBuf(INT32U ulPcs, INT8U *pucTxBuf, INT8U *pucRxBuf, INT16U usLen);


        
#ifdef __cplusplus
}
#endif


#endif


/*********************************************************************************************************
 End Of File 
*********************************************************************************************************/
